app/controllers/drugs_controller.rb

SELECT "holders".* FROM "holders" WHERE "holders"."id" IN (10)
SELECT "producers".* FROM "producers" WHERE "producers"."id" IN (355)
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" IN (66)
---
  def wide_search
    if params[:q].nil? then alert[:error] = 'Cannot be empty'  end

    # Textacular
    drug_ = Drug.search_by_more_attr_texticle(params[:q]).includes(:supplier, :holder, :producer)

SELECT "holders".* FROM "holders" WHERE "holders"."id" IN (2709, 4723, 1811, 2499, 4293, 2823, 3964, 2950, 10, 2562, 2335, 183, 2026, 18, 1802, 4761, 3886, 1772, 2095, 3652, 2502, 2089)
SELECT "producers".* FROM "producers" WHERE "producers"."id" IN (443, 389, 364, 102, 355, 279, 421, 50)
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" IN (83, 166, 14, 44, 21, 66, 125, 64, 104, 121, 72, 55)
SELECT "drugs".* FROM "drugs" JOIN clicks ON clicks.drug_id = drugs.id WHERE (label SIMILAR TO '%bolest_%(\mhlav_\M|\ml_cn|\ml_c\M)%' OR usage SIMILAR TO '%bolest_%(\mhlav_\M|\ml_cn|\ml_c\M)%') ORDER BY clicks.no_of_clicks DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "drugs" JOIN clicks ON clicks.drug_id = drugs.id WHERE (label SIMILAR TO '%bolest_%(\mhlav_\M|\ml_cn|\ml_c\M)%' OR usage SIMILAR TO '%bolest_%(\mhlav_\M|\ml_cn|\ml_c\M)%')
---
  def body_clicked_search
    drug_ =  Drug.includes(:supplier, :holder, :producer).find_drugs_by_clicks(params[:q])
    @drug = drug_.paginate(page: params[:page])  if !drug_.nil?

SELECT "drugs".* FROM "drugs"
---
  def index
    @drug = Drug.where('name ILIKE ?', "%#{params[:q]}%")

    respond_to do |format|
      format.html # index.html.erb
      format.json { render json: @drug.map(&:attributes) }

INSERT INTO "drugs" ("admin", "code", "form", "holder_id", "label", "name", "producer_id", "sukl_name", "sukl_name_old", "supplier_id", "usage") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @drug = Drug.new(params[:drug])

    respond_to do |format|
      if @drug.save