app/controllers/holders_controller.rb

  def find
    @holder = Holder.find_holders_like_name params[:name]
---
SELECT "holders".* FROM "holders" WHERE (name_clean ILIKE 'boiron%')

  def index
    @holders = Holder.all
---
SELECT "holders".* FROM "holders"

  def show
    @holder = Holder.find(params[:id])
---
SELECT "holders".* FROM "holders" WHERE "holders"."id" = $1 LIMIT 1  [["id", "4897"]]

  def edit
    @holder = Holder.find(params[:id])
---
SELECT "holders".* FROM "holders" WHERE "holders"."id" = $1 LIMIT 1  [["id", "4891"]]

  def create
    @holder = Holder.new(params[:holder])

    respond_to do |format|
      if @holder.save
---
INSERT INTO "holders" ("name", "name_clean") VALUES ($1, $2) RETURNING "id"  [["name", nil], ["name_clean", nil]]

  def update
    @holder = Holder.find(params[:id])
---
SELECT "holders".* FROM "holders" WHERE "holders"."id" = $1 LIMIT 1  [["id", "4898"]]

  def destroy
    @holder = Holder.find(params[:id])
    @holder.destroy
---
SELECT "holders".* FROM "holders" WHERE "holders"."id" = $1 LIMIT 1  [["id", "4895"]]
DELETE FROM "holders" WHERE "holders"."id" = $1  [["id", 4895]]