app/controllers/producers_controller.rb

  def find
    @producer = Producer.find_producers_like_name params[:name]
---
SELECT "producers".* FROM "producers" WHERE (name_clean ILIKE 'zentiva%')

  def index
    @producers = Producer.all
---
SELECT "producers".* FROM "producers"

  def show
    @producer = Producer.find(params[:id])
---
SELECT "producers".* FROM "producers" WHERE "producers"."id" = $1 LIMIT 1  [["id", "489"]]

  def edit
    @producer = Producer.find(params[:id])
---
SELECT "producers".* FROM "producers" WHERE "producers"."id" = $1 LIMIT 1  [["id", "483"]]

  def create
    @producer = Producer.new(params[:producer])

    respond_to do |format|
      if @producer.save
---
INSERT INTO "producers" ("name", "name_clean") VALUES ($1, $2) RETURNING "id"  [["name", nil], ["name_clean", nil]]

  def update
    @producer = Producer.find(params[:id])
---
SELECT "producers".* FROM "producers" WHERE "producers"."id" = $1 LIMIT 1  [["id", "490"]]

  def destroy
    @producer = Producer.find(params[:id])
    @producer.destroy
---
SELECT "producers".* FROM "producers" WHERE "producers"."id" = $1 LIMIT 1  [["id", "487"]]
DELETE FROM "producers" WHERE "producers"."id" = $1  [["id", 487]]