app/controllers/statistics_controller.rb

  def index
    @statistics = Statistic.all
---
SELECT "statistics".* FROM "statistics"

  def create
    @statistic = Statistic.new(params[:statistic])

    respond_to do |format|
      if @statistic.save
---
INSERT INTO "statistics" ("id") VALUES ($1)  [["id", nil]]