app/controllers/suppliers_controller.rb

  def find
    @producer = Supplier.find_supplier_like_name params[:name]
---
SELECT "suppliers".* FROM "suppliers" WHERE (name_clean ILIKE 'boiron%')

  def index
    @suppliers = Supplier.all
---
SELECT "suppliers".* FROM "suppliers"

  def show
    @supplier = Supplier.find(params[:id])
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT 1  [["id", "173"]]

  def edit
    @supplier = Supplier.find(params[:id])
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT 1  [["id", "167"]]

  def create
    @supplier = Supplier.new(params[:supplier])

    respond_to do |format|
      if @supplier.save
---
INSERT INTO "suppliers" ("name", "name_clean") VALUES ($1, $2) RETURNING "id"  [["name", nil], ["name_clean", nil]]

  def update
    @supplier = Supplier.find(params[:id])
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT 1  [["id", "174"]]

  def destroy
    @supplier = Supplier.find(params[:id])
    @supplier.destroy
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT 1  [["id", "171"]]
DELETE FROM "suppliers" WHERE "suppliers"."id" = $1  [["id", 171]]